#+PROPERTY: header-args :exports both

This describes how I created a macro to simplify code to build a list of strings
by adding or not adding certain strings based on the values of some variables.

There was a problem with that approach.  I describe how the macro works in terms
of evaluation order etc.  Then I show the problem.  Finally I show the source of
this endeavour and why I went back to original simple function.

* Goal

The macro was created to write a function like this one more conveniently:

#+begin_src emacs-lisp
(defun build-list-func ()
  (let ((result (list)))
    (push "x" result)
    (push (concat "a" "b") result)
    (when nil
      (error "HELLO"))
    (when (eq 2 2)
      (push "-F" result)
      (push x-config-file result))
    (push sky-color result)
    (when x-n-jobs
      (push "-j" result)
      (push x-n-jobs result))
    (when x-all
      (push "--all" result))
    (reverse result)))
(build-list-func)
#+end_src

#+RESULTS:
| x | ab | -F | ~/.config/hello.yml | blue | -j | 80 | --all |

*** Building the command using the macro
#+begin_src emacs-lisp
(build-list (t "x")
            (t           (concat "a" "b"))
            (nil         (error "HELLO"))               ;; Never evaluated
            ((eq 2 2)    "-F")
            ((eq 2 2)    x-config-file)
            (t           sky-color)
            (x-n-jobs    "-j")
            (x-n-jobs    (number-to-string x-n-jobs))
            (x-all       "--all"))
#+end_src

#+RESULTS:
| x | ab | -F | ~/.config/hello.yml | blue | -j | 80 | --all |

The =right= expressions for which =left= was true end up in =result= in reverse
order.

*** Result of macro expansion
The combination of =`(let ... (dolist (e ',result)...))= creates this expression
which is what the macro returns.

#+begin_src emacs-lisp
(let ((true-result (list)))
  (dolist (e '("--all"
               (number-to-string x-n-jobs)
               "-j"
               sky-color
               x-config-file
               "-F"
               (concat "a" "b")
               "x"))
    (push (eval e) true-result))
  true-result)
#+end_src

#+RESULTS:
| x | ab | -F | ~/.config/hello.yml | blue | -j | 80 | --all |

** Evaluating with =C-c C-c= defers expansion

First I =C-c C-c= this block
#+begin_src emacs-lisp
(setq x-all t)
(setq x-n-jobs "80")
(setq x-ignore nil)
(defun my-thing ()
  (build-list (x-all "all")
              (x-n-jobs x-n-jobs)
              (x-ignore "ignore")))
(my-thing)
#+end_src

#+RESULTS:
| all | 80 |

Then I =C-c C-c= this one.
#+begin_src emacs-lisp
(setq x-all nil)
(my-thing)
#+end_src

#+RESULTS:
| 80 |

I get what I intended.

** Evaluating the =defun= with =C-x C-e= expands the macro

First we reset our variables:
#+begin_src elisp
(setq x-all t)
(setq x-n-jobs "80")
(setq x-ignore nil)
#+end_src

Next we define =my-thing= but this time by =C-x C-e=-ing the expression:

#+begin_example
(defun my-thing ()
  (build-list (x-all "all")
              (x-n-jobs x-n-jobs)
              (x-ignore "ignore")))
#+end_example

And then we can try it out by =C-c C-c=-ing the next blocks:

#+begin_src emacs-lisp
(my-thing)
#+end_src

#+RESULTS:
| all | 80 |

#+begin_src emacs-lisp
(setq x-all nil)
(setq x-n-jobs "80")
(setq x-ignore nil)
(my-thing)
#+end_src

#+RESULTS:
| all | 80 |

This would be because the macro is expanded in that case and we end up with this
definition of the function:
#+begin_src elisp
(setq x-all t)
(setq x-n-jobs "80")
(setq x-ignore nil)
(defun my-thing ()
  (let ((true-result (list)))
    (dolist (e '(x-n-jobs
                 "all"))
      (push (eval e) true-result))
    true-result))
#+end_src
a function that just adds ="all"= and =x-n-jobs= to a list.

** Forcing the macro expansion to be deferred

Here we can defer the expansion of the macro.  We can now =C-x C-e= this
expression and the function will evaluate the expansion of expand the macro
during the call.
#+begin_example
(defun my-thing ()
  (eval '(build-list (x-all "all")
                     (x-n-jobs x-n-jobs)
                     (x-ignore "ignore"))))
#+end_example

Now we can try our first case:
#+begin_src emacs-lisp
(setq x-all t)
(setq x-n-jobs "80")
(setq x-ignore nil)
(my-thing)
#+end_src

#+RESULTS:
| all | 80 |

And we can change the variables and see that it has an effect:
#+begin_src emacs-lisp
(setq x-all nil)
(setq x-n-jobs "80")
(setq x-ignore nil)
(my-thing)
#+end_src

#+RESULTS:
| 80 |

The string ="all"= is not there.

